Solvgraa-mager/E3PRJ3/Software/Styringsenhed/ADC/ADC MK III/ADC MK III.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.3
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2019 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "UART_1.h"
#include "isr_uart_rx.h"
#include "DMA_1_dma.h"
#include "ADC_DelSig.h"
#include "Floejtelyd_aliases.h"
#include "Floejtelyd.h"
#include "ISR_DMA_Done.h"
#include "dma_done_test_aliases.h"
#include "dma_done_test.h"
#include "ADC_EOC_aliases.h"
#include "ADC_EOC.h"
#include "Opamp_1.h"
#include "VREF_OUT_aliases.h"
#include "VREF_OUT.h"
#include "Hann_Flag_aliases.h"
#include "Hann_Flag.h"
#include "FFT_Flag_aliases.h"
#include "FFT_Flag.h"
#include "UART_1_IntClock.h"
#include "ADC_DelSig_Ext_CP_Clk.h"
#include "ADC_DelSig_IRQ.h"
#include "ADC_DelSig_theACLK.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

